<?php
 

include "rule.php";
$userstable = "regions"; 

 
 
$s = '["Республика Адыгея","Майкоп","Республика Башкортостан","Уфа","Республика Бурятия","Улан-Удэ","Республика Алтай","Горно-Алтайск","Республика Дагестан","Махачкала","Республика Ингушетия","Назрань","Кабардино-Балкарская Республика","Нальчик","Республика Калмыкия","Элиста","Республика Карачаево-Черкессия","Черкесск","Республика Карелия","Петрозаводск","Республика Коми","Сыктывкар","Республика Марий Эл","Йошкар-Ола","Республика Мордовия","Саранск","Республика Саха (Якутия)","Якутск","Республика Северная Осетия-Алания","Владикавказ","Республика Татарстан","Казань","Республика Тыва","Кызыл","Республика Удмуртия","Ижевск","Республика Хакасия","Абакан","Чеченская республика","Грозный","Чувашская Республика","Чебоксары","Алтайский край","Барнаул","Краснодарский край","Краснодар","Красноярский край","Красноярск","Приморский край","Владивосток","Ставропольский край","Ставрополь","Хабаровский край","Хабаровск","Амурская область","Благовещенск","Архангельская область","Архангельск","Астраханская область","Астрахань","Белгородская область","Белгород","Брянская область","Брянск","Владимирская область","Владимир","Волгоградская область","Волгоград","Вологодская область","Вологда","Воронежская область","Воронеж","Ивановская область","Иваново","Иркутская область","Иркутск","Калининградская область","Калининград","Калужская область","Калуга","Камчатский край","Петропавловск-Камчатский","Кемеровская область","Кемерово","Кировская область","Киров","Костромская область","Кострома","Курганская область","Курган","Курская область","Курск","Ленинградская область","Санкт-Петербург","Липецкая область","Липецк","Магаданская область","Магадан","Московская область","Москва","Мурманская область","Мурманск","Нижегородская область","Нижний Новгород","Новгородская область","Новгород","Новосибирская область","Новосибирск","Омская область","Омск","Оренбургская область","Оренбург","Орловская область","Орел","Пензенская область","Пенза","Пермский край","Пермь","Псковская область","Псков","Ростовская область","Ростов-на-Дону","Рязанская область","Рязань","Самарская область","Самара","Саратовская область","Саратов","Сахалинская область","Южно-Сахалинск","Свердловская область","Екатеринбург","Смоленская область","Смоленск","Тамбовская область","Тамбов","Тверская область","Тверь","Томская область","Томск","Тульская область","Тула","Тюменская область","Тюмень","Ульяновская область","Ульяновск","Челябинская область","Челябинск","Забайкальский край","Чита","Ярославская область","Ярославль","Еврейская автономная область","Биробиджан","Ненецкий автономный округ","Нарьян-Мар","Ханты-Мансийский автономный округ - Югра","Ханты-Мансийск","Чукотский автономный округ","Анадырь","Ямало-Ненецкий автономный округ","Салехард","Республика Крым","Севастополь"]';  


 
 mysql_connect($hostname,$username,$password) or die("No connection"); 
  mysql_query("SET NAMES utf8");
 mysql_query("SET COLLATION_CONNECTION=utf8_bin");
 mysql_select_db($dbName) or die(mysql_error());  

$json_ar = json_decode($s);
$length = count($json_ar);
$e=1;
for($i=0;$i<$length-1;$i+=2){

 $query = "INSERT INTO   $userstable SET id='".$e."' , name_region='".$json_ar[$i]."' , city_name='".$json_ar[$i+1]."'";
 $e++;
mysql_query($query) or die( mysql_error());


 }//for
 
 
 


mysql_close();

 


 
?>