-- phpMyAdmin SQL Dump
-- version 4.1.11
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Окт 20 2014 г., 01:20
-- Версия сервера: 5.5.34-32.0
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `homelessru_map`
--

-- --------------------------------------------------------

--
-- Структура таблицы `body`
--

CREATE TABLE IF NOT EXISTS `body` (
  `id_mark` varchar(35) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `user_name` varchar(15) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `id_region` int(10) NOT NULL,
  `json_body` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `status` int(2) NOT NULL,
  `hidden_flag` int(2) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id_mark`),
  UNIQUE KEY `id_mark` (`id_mark`),
  KEY `id_region` (`id_region`),
  KEY `id_mark_2` (`id_mark`),
  KEY `user_name` (`user_name`),
  KEY `status` (`status`),
  KEY `hidden_flag` (`hidden_flag`),
  KEY `date` (`date`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Структура таблицы `regions`
--

CREATE TABLE IF NOT EXISTS `regions` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name_region` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `city_name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  KEY `city_name` (`city_name`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=83 ;

--
-- Дамп данных таблицы `regions`
--

INSERT INTO `regions` (`id`, `name_region`, `city_name`) VALUES
(1, 'Республика Адыгея', 'Майкоп'),
(2, 'Республика Башкортостан', 'Уфа'),
(3, 'Республика Бурятия', 'Улан-Удэ'),
(4, 'Республика Алтай', 'Горно-Алтайск'),
(5, 'Республика Дагестан', 'Махачкала'),
(6, 'Республика Ингушетия', 'Назрань'),
(7, 'Кабардино-Балкарская Республика', 'Нальчик'),
(8, 'Республика Калмыкия', 'Элиста'),
(9, 'Республика Карачаево-Черкессия', 'Черкесск'),
(10, 'Республика Карелия', 'Петрозаводск'),
(11, 'Республика Коми', 'Сыктывкар'),
(12, 'Республика Марий Эл', 'Йошкар-Ола'),
(13, 'Республика Мордовия', 'Саранск'),
(14, 'Республика Саха (Якутия)', 'Якутск'),
(15, 'Республика Северная Осетия-Алания', 'Владикавказ'),
(16, 'Республика Татарстан', 'Казань'),
(17, 'Республика Тыва', 'Кызыл'),
(18, 'Республика Удмуртия', 'Ижевск'),
(19, 'Республика Хакасия', 'Абакан'),
(20, 'Чеченская республика', 'Грозный'),
(21, 'Чувашская Республика', 'Чебоксары'),
(22, 'Алтайский край', 'Барнаул'),
(23, 'Краснодарский край', 'Краснодар'),
(24, 'Красноярский край', 'Красноярск'),
(25, 'Приморский край', 'Владивосток'),
(26, 'Ставропольский край', 'Ставрополь'),
(27, 'Хабаровский край', 'Хабаровск'),
(28, 'Амурская область', 'Благовещенск'),
(29, 'Архангельская область', 'Архангельск'),
(30, 'Астраханская область', 'Астрахань'),
(31, 'Белгородская область', 'Белгород'),
(32, 'Брянская область', 'Брянск'),
(33, 'Владимирская область', 'Владимир'),
(34, 'Волгоградская область', 'Волгоград'),
(35, 'Вологодская область', 'Вологда'),
(36, 'Воронежская область', 'Воронеж'),
(37, 'Ивановская область', 'Иваново'),
(38, 'Иркутская область', 'Иркутск'),
(39, 'Калининградская область', 'Калининград'),
(40, 'Калужская область', 'Калуга'),
(41, 'Камчатский край', 'Петропавловск-Камчатский'),
(42, 'Кемеровская область', 'Кемерово'),
(43, 'Кировская область', 'Киров'),
(44, 'Костромская область', 'Кострома'),
(45, 'Курганская область', 'Курган'),
(46, 'Курская область', 'Курск'),
(47, 'Ленинградская область', 'Санкт-Петербург'),
(48, 'Липецкая область', 'Липецк'),
(49, 'Магаданская область', 'Магадан'),
(50, 'Московская область', 'Москва'),
(51, 'Мурманская область', 'Мурманск'),
(52, 'Нижегородская область', 'Нижний Новгород'),
(53, 'Новгородская область', 'Новгород'),
(54, 'Новосибирская область', 'Новосибирск'),
(55, 'Омская область', 'Омск'),
(56, 'Оренбургская область', 'Оренбург'),
(57, 'Орловская область', 'Орел'),
(58, 'Пензенская область', 'Пенза'),
(59, 'Пермский край', 'Пермь'),
(60, 'Псковская область', 'Псков'),
(61, 'Ростовская область', 'Ростов-на-Дону'),
(62, 'Рязанская область', 'Рязань'),
(63, 'Самарская область', 'Самара'),
(64, 'Саратовская область', 'Саратов'),
(65, 'Сахалинская область', 'Южно-Сахалинск'),
(66, 'Свердловская область', 'Екатеринбург'),
(67, 'Смоленская область', 'Смоленск'),
(68, 'Тамбовская область', 'Тамбов'),
(69, 'Тверская область', 'Тверь'),
(70, 'Томская область', 'Томск'),
(71, 'Тульская область', 'Тула'),
(72, 'Тюменская область', 'Тюмень'),
(73, 'Ульяновская область', 'Ульяновск'),
(74, 'Челябинская область', 'Челябинск'),
(75, 'Забайкальский край', 'Чита'),
(76, 'Ярославская область', 'Ярославль'),
(77, 'Еврейская автономная область', 'Биробиджан'),
(78, 'Ненецкий автономный округ', 'Нарьян-Мар'),
(79, 'Ханты-Мансийский автономный округ - Югра', 'Ханты-Мансийск'),
(80, 'Чукотский автономный округ', 'Анадырь'),
(81, 'Ямало-Ненецкий автономный округ', 'Салехард'),
(82, 'Республика Крым', 'Севастополь');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `pass` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `rule` int(2) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=12 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `pass`, `rule`) VALUES
(3, 'admin', 'ghjlfriby', 3),
(5, 'sadam', 'vyj;tcndj', 1),
(6, 'solomon', 'wfhm', 2),
(8, 'kira', 'havab', 1),
(10, 'midas', 'pjkjnj', 2),
(11, 'doter', 'dsfsdfd', 1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
